# CreateCenteredStaticText

## Description
Similar to CreateStaticText, but creates static text that is centered in its control field on the dialog.

```pascal
PROCEDURE CreateCenteredStaticText(
				dialogID          : LONGINT;
				controlID         : LONGINT;
				text              : STRING;
				widthInCharacters : INTEGER);
```

```python
def vs.CreateCenteredStaticText(dialogID, controlID, text, widthInCharacters):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|controlID|LONGINT|   |
|text|STRING|   |
|widthInCharacters|INTEGER|   |

## Version
Availability: from VectorWorks12.0.1

## Category
* Dialogs - Modern